tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1708_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1708_H_
#define _PIC16F1708_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define CCPIF                         60
#define SSP1IF                        61
#define TXIF                          62
#define RCIF                          63
#define ADIF                          64
#define TMR1GIF                       65
#define PIR2                          66
#define CCP2IF                        67
#define TMR4IF                        68
#define TMR6IF                        69
#define BCL1IF                        70
#define C1IF                          71
#define C2IF                          72
#define OSFIF                         73
#define PIR3                          74
#define CLC1IF                        75
#define CLC2IF                        76
#define CLC3IF                        77
#define ZCDIF                         78
#define COGIF                         79
#define TMR0                          80
#define TMR1L                         81
#define TMR1H                         82
#define T1CON                         83
#define TMR1ON                        84
#define nT1SYNC                       85
#define T1OSCEN                       86
#define T1CKPS0                       87
#define T1CKPS                        88
#define T1CKPS1                       89
#define TMR1CS0                       90
#define TMR1CS                        91
#define TMR1CS1                       92
#define T1GCON                        93
#define T1GSS0                        94
#define T1GSS                         95
#define T1GSS1                        96
#define T1GVAL                        97
#define T1GGO_nDONE                   98
#define T1GSPM                        99
#define T1GTM                         100
#define T1GPOL                        101
#define TMR1GE                        102
#define TMR2                          103
#define PR2                           104
#define T2CON                         105
#define T2CKPS0                       106
#define T2CKPS                        107
#define T2CKPS1                       108
#define TMR2ON                        109
#define T2OUTPS0                      110
#define T2OUTPS                       111
#define T2OUTPS1                      112
#define T2OUTPS2                      113
#define T2OUTPS3                      114
#define TRISA                         115
#define TRISA0                        116
#define TRISA1                        117
#define TRISA2                        118
#define TRISA4                        119
#define TRISA5                        120
#define TRISB                         121
#define TRISB4                        122
#define TRISB5                        123
#define TRISB6                        124
#define TRISB7                        125
#define TRISC                         126
#define TRISC0                        127
#define TRISC1                        128
#define TRISC2                        129
#define TRISC3                        130
#define TRISC4                        131
#define TRISC5                        132
#define TRISC6                        133
#define TRISC7                        134
#define PIE1                          135
#define TMR1IE                        136
#define TMR2IE                        137
#define CCP1IE                        138
#define CCPIE                         139
#define SSP1IE                        140
#define TXIE                          141
#define RCIE                          142
#define ADIE                          143
#define TMR1GIE                       144
#define PIE2                          145
#define CCP2IE                        146
#define TMR4IE                        147
#define TMR6IE                        148
#define BCL1IE                        149
#define C1IE                          150
#define C2IE                          151
#define OSFIE                         152
#define PIE3                          153
#define CLC1IE                        154
#define CLC2IE                        155
#define CLC3IE                        156
#define ZCDIE                         157
#define COGIE                         158
#define OPTION_REG                    159
#define PS                            160
#define PS0                           161
#define PS1                           162
#define PS2                           163
#define PSA                           164
#define T0SE                          165
#define TMR0SE                        166
#define T0CS                          167
#define TMR0CS                        168
#define INTEDG                        169
#define nWPUEN                        170
#define PCON                          171
#define nBOR                          172
#define nPOR                          173
#define nRI                           174
#define nRMCLR                        175
#define nRWDT                         176
#define STKUNF                        177
#define STKOVF                        178
#define WDTCON                        179
#define SWDTEN                        180
#define WDTPS                         181
#define WDTPS0                        182
#define WDTPS1                        183
#define WDTPS2                        184
#define WDTPS3                        185
#define WDTPS4                        186
#define OSCTUNE                       187
#define TUN0                          188
#define TUN                           189
#define TUN1                          190
#define TUN2                          191
#define TUN3                          192
#define TUN4                          193
#define TUN5                          194
#define OSCCON                        195
#define SCS0                          196
#define SCS                           197
#define SCS1                          198
#define IRCF                          199
#define IRCF0                         200
#define IRCF1                         201
#define IRCF2                         202
#define IRCF3                         203
#define SPLLEN                        204
#define OSCSTAT                       205
#define HFIOFS                        206
#define LFIOFR                        207
#define MFIOFR                        208
#define HFIOFL                        209
#define HFIOFR                        210
#define OSTS                          211
#define PLLR                          212
#define SOSCR                         213
#define ADRESL                        214
#define ADRESH                        215
#define ADCON0                        216
#define ADON                          217
#define GO_nDONE                      218
#define GO                            219
#define ADGO                          220
#define CHS0                          221
#define CHS                           222
#define CHS1                          223
#define CHS2                          224
#define CHS3                          225
#define CHS4                          226
#define ADCON1                        227
#define ADPREF0                       228
#define ADPREF                        229
#define ADPREF1                       230
#define ADNREF                        231
#define ADCS0                         232
#define ADCS                          233
#define ADCS1                         234
#define ADCS2                         235
#define ADFM                          236
#define ADCON2                        237
#define TRIGSEL                       238
#define TRIGSEL0                      239
#define TRIGSEL1                      240
#define TRIGSEL2                      241
#define TRIGSEL3                      242
#define LATA                          243
#define LATA0                         244
#define LATA1                         245
#define LATA2                         246
#define LATA4                         247
#define LATA5                         248
#define LATB                          249
#define LATB4                         250
#define LATB5                         251
#define LATB6                         252
#define LATB7                         253
#define LATC                          254
#define LATC0                         255
#define LATC1                         256
#define LATC2                         257
#define LATC3                         258
#define LATC4                         259
#define LATC5                         260
#define LATC6                         261
#define LATC7                         262
#define CM1CON0                       263
#define C1SYNC                        264
#define C1HYS                         265
#define C1SP                          266
#define C1ZLF                         267
#define C1POL                         268
#define C1OUT                         269
#define C1ON                          270
#define CM1CON1                       271
#define C1NCH0                        272
#define C1NCH                         273
#define C1NCH1                        274
#define C1NCH2                        275
#define C1PCH                         276
#define C1PCH0                        277
#define C1PCH1                        278
#define C1PCH2                        279
#define C1INTN                        280
#define C1INTP                        281
#define CM2CON0                       282
#define C2SYNC                        283
#define C2HYS                         284
#define C2SP                          285
#define C2ZLF                         286
#define C2POL                         287
#define C2OUT                         288
#define C2ON                          289
#define CM2CON1                       290
#define C2NCH0                        291
#define C2NCH                         292
#define C2NCH1                        293
#define C2NCH2                        294
#define C2PCH                         295
#define C2PCH0                        296
#define C2PCH1                        297
#define C2PCH2                        298
#define C2INTN                        299
#define C2INTP                        300
#define CMOUT                         301
#define MC1OUT                        302
#define MC2OUT                        303
#define BORCON                        304
#define BORRDY                        305
#define BORFS                         306
#define SBOREN                        307
#define FVRCON                        308
#define ADFVR0                        309
#define ADFVR                         310
#define ADFVR1                        311
#define CDAFVR                        312
#define CDAFVR0                       313
#define CDAFVR1                       314
#define TSRNG                         315
#define TSEN                          316
#define FVRRDY                        317
#define FVREN                         318
#define DAC1CON0                      319
#define DACNSS                        320
#define DAC1NSS                       321
#define DACPSS                        322
#define DACPSS0                       323
#define DAC1PSS                       324
#define DAC1PSS0                      325
#define DACPSS1                       326
#define DAC1PSS1                      327
#define DACOE0                        328
#define DAC1OE2                       329
#define DAC1OE1                       330
#define DACOE1                        331
#define DACEN                         332
#define DAC1EN                        333
#define DAC1CON1                      334
#define DAC1R                         335
#define DACR0                         336
#define DAC1R0                        337
#define DACR1                         338
#define DAC1R1                        339
#define DACR2                         340
#define DAC1R2                        341
#define DACR3                         342
#define DAC1R3                        343
#define DACR4                         344
#define DAC1R4                        345
#define DACR5                         346
#define DAC1R5                        347
#define DACR6                         348
#define DAC1R6                        349
#define DACR7                         350
#define DAC1R7                        351
#define ZCD1CON                       352
#define ZCD1INTN                      353
#define ZCD1INTP                      354
#define ZCD1POL                       355
#define ZCD1OUT                       356
#define ZCD1EN                        357
#define ANSELA                        358
#define ANSA0                         359
#define ANSA1                         360
#define ANSA2                         361
#define ANSA4                         362
#define ANS5                          363
#define ANSELB                        364
#define ANSB4                         365
#define ANSB5                         366
#define ANSB6                         367
#define ANSB7                         368
#define ANSELC                        369
#define ANSC0                         370
#define ANSC1                         371
#define ANSC2                         372
#define ANSC3                         373
#define ANSC6                         374
#define ANSC7                         375
#define PMADRL                        376
#define PMADRH                        377
#define PMDATL                        378
#define PMDATH                        379
#define PMCON1                        380
#define RD                            381
#define WR                            382
#define WREN                          383
#define WRERR                         384
#define FREE                          385
#define LWLO                          386
#define CFGS                          387
#define PMCON2                        388
#define VREGCON                       389
#define VREGPM                        390
#define RC1REG                        391
#define TX1REG                        392
#define SP1BRGL                       393
#define SP1BRGH                       394
#define RC1STA                        395
#define RX9D                          396
#define OERR                          397
#define FERR                          398
#define ADDEN                         399
#define CREN                          400
#define SREN                          401
#define RX9                           402
#define SPEN                          403
#define TX1STA                        404
#define TX9D                          405
#define TRMT                          406
#define BRGH                          407
#define SENDB                         408
#define SYNC                          409
#define TXEN                          410
#define TX9                           411
#define CSRC                          412
#define BAUD1CON                      413
#define ABDEN                         414
#define WUE                           415
#define BRG16                         416
#define SCKP                          417
#define RCIDL                         418
#define ABDOVF                        419
#define WPUA                          420
#define WPUA0                         421
#define WPUA1                         422
#define WPUA2                         423
#define WPUA3                         424
#define WPUA4                         425
#define WPUA5                         426
#define WPUB                          427
#define WPUB4                         428
#define WPUB5                         429
#define WPUB6                         430
#define WPUB7                         431
#define WPUC                          432
#define WPUC0                         433
#define WPUC1                         434
#define WPUC2                         435
#define WPUC3                         436
#define WPUC4                         437
#define WPUC5                         438
#define WPUC6                         439
#define WPUC7                         440
#define SSP1BUF                       441
#define BUF                           442
#define BUF0                          443
#define SSP1BUF0                      444
#define BUF1                          445
#define SSP1BUF1                      446
#define BUF2                          447
#define SSP1BUF2                      448
#define BUF3                          449
#define SSP1BUF3                      450
#define BUF4                          451
#define SSP1BUF4                      452
#define BUF5                          453
#define SSP1BUF5                      454
#define BUF6                          455
#define SSP1BUF6                      456
#define BUF7                          457
#define SSP1BUF7                      458
#define ADD0                          459
#define ADD                           460
#define SSP1ADD0                      461
#define SSP1ADD                       462
#define ADD1                          463
#define SSP1ADD1                      464
#define ADD2                          465
#define SSP1ADD2                      466
#define ADD3                          467
#define SSP1ADD3                      468
#define ADD4                          469
#define SSP1ADD4                      470
#define ADD5                          471
#define SSP1ADD5                      472
#define ADD6                          473
#define SSP1ADD6                      474
#define ADD7                          475
#define SSP1ADD7                      476
#define SSP1MSK0                      477
#define SSP1MSK                       478
#define MSK0                          479
#define MSK                           480
#define SSP1MSK1                      481
#define MSK1                          482
#define SSP1MSK2                      483
#define MSK2                          484
#define SSP1MSK3                      485
#define MSK3                          486
#define SSP1MSK4                      487
#define MSK4                          488
#define SSP1MSK5                      489
#define MSK5                          490
#define SSP1MSK6                      491
#define MSK6                          492
#define SSP1MSK7                      493
#define MSK7                          494
#define SSP1STAT                      495
#define BF                            496
#define UA                            497
#define R_nW                          498
#define S                             499
#define P                             500
#define D_nA                          501
#define CKE                           502
#define SMP                           503
#define SSP1CON1                      504
#define SSPM0                         505
#define SSPM                          506
#define SSPM1                         507
#define SSPM2                         508
#define SSPM3                         509
#define CKP                           510
#define SSPEN                         511
#define SSPOV                         512
#define WCOL                          513
#define SSP1CON2                      514
#define SEN                           515
#define RSEN                          516
#define PEN                           517
#define RCEN                          518
#define ACKEN                         519
#define ACKDT                         520
#define ACKSTAT                       521
