tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1708_tdd.h
#define GCEN                          522
#define SSP1CON3                      523
#define DHEN                          524
#define AHEN                          525
#define SBCDE                         526
#define SDAHT                         527
#define BOEN                          528
#define SCIE                          529
#define PCIE                          530
#define ACKTIM                        531
#define ODCONA                        532
#define ODA0                          533
#define ODA1                          534
#define ODA2                          535
#define ODA4                          536
#define ODA5                          537
#define ODCONB                        538
#define ODB4                          539
#define ODB5                          540
#define ODB6                          541
#define ODB7                          542
#define ODCONC                        543
#define ODC0                          544
#define ODC1                          545
#define ODC2                          546
#define ODC3                          547
#define ODC4                          548
#define ODC5                          549
#define ODC6                          550
#define ODC7                          551
#define CCPR1L                        552
#define CCPR1H                        553
#define CCP1CON                       554
#define CCP1M0                        555
#define CCP1M                         556
#define CCP1M1                        557
#define CCP1M2                        558
#define CCP1M3                        559
#define CCP1Y                         560
#define DC1B                          561
#define DC1B0                         562
#define CCP1X                         563
#define DC1B1                         564
#define CCPR2L                        565
#define CCPR2H                        566
#define CCP2CON                       567
#define CCP2M                         568
#define CCP2M0                        569
#define CCP2M1                        570
#define CCP2M2                        571
#define CCP2M3                        572
#define DC2B0                         573
#define CCP2Y                         574
#define DC2B                          575
#define DC2B1                         576
#define CCP2X                         577
#define CCPTMRS                       578
#define C1TSEL0                       579
#define C1TSEL                        580
#define C1TSEL1                       581
#define C2TSEL0                       582
#define C2TSEL                        583
#define C2TSEL1                       584
#define P3TSEL                        585
#define P3TSEL0                       586
#define P3TSEL1                       587
#define P4TSEL0                       588
#define P4TSEL                        589
#define P4TSEL1                       590
#define SLRCONA                       591
#define SLRA0                         592
#define SLRA1                         593
#define SLRA2                         594
#define SLRA4                         595
#define SLRA5                         596
#define SLRCONB                       597
#define SLRB4                         598
#define SLRB5                         599
#define SLRB6                         600
#define SLRB7                         601
#define SLRCONC                       602
#define SLRC0                         603
#define SLRC1                         604
#define SLRC2                         605
#define SLRC3                         606
#define SLRC4                         607
#define SLRC5                         608
#define SLRC6                         609
#define SLRC7                         610
#define INLVLA                        611
#define INLVLA0                       612
#define INLVLA1                       613
#define INLVLA2                       614
#define INLVLA3                       615
#define INLVLA4                       616
#define INLVLA5                       617
#define INLVLB                        618
#define INLVLB4                       619
#define INLVLB5                       620
#define INLVLB6                       621
#define INLVLB7                       622
#define INLVLC                        623
#define INLVLC0                       624
#define INLVLC1                       625
#define INLVLC2                       626
#define INLVLC3                       627
#define INLVLC4                       628
#define INLVLC5                       629
#define INLVLC6                       630
#define INLVLC7                       631
#define IOCAP                         632
#define IOCAP0                        633
#define IOCAP1                        634
#define IOCAP2                        635
#define IOCAP3                        636
#define IOCAP4                        637
#define IOCAP5                        638
#define IOCAN                         639
#define IOCAN0                        640
#define IOCAN1                        641
#define IOCAN2                        642
#define IOCAN3                        643
#define IOCAN4                        644
#define IOCAN5                        645
#define IOCAF                         646
#define IOCAF0                        647
#define IOCAF1                        648
#define IOCAF2                        649
#define IOCAF3                        650
#define IOCAF4                        651
#define IOCAF5                        652
#define IOCBP                         653
#define IOCBP4                        654
#define IOCBP5                        655
#define IOCBP6                        656
#define IOCBP7                        657
#define IOCBN                         658
#define IOCBN4                        659
#define IOCBN5                        660
#define IOCBN6                        661
#define IOCBN7                        662
#define IOCBF                         663
#define IOCBF4                        664
#define IOCBF5                        665
#define IOCBF6                        666
#define IOCBF7                        667
#define IOCCP                         668
#define IOCCP0                        669
#define IOCCP1                        670
#define IOCCP2                        671
#define IOCCP3                        672
#define IOCCP4                        673
#define IOCCP5                        674
#define IOCCP6                        675
#define IOCCP7                        676
#define IOCCN                         677
#define IOCCN0                        678
#define IOCCN1                        679
#define IOCCN2                        680
#define IOCCN3                        681
#define IOCCN4                        682
#define IOCCN5                        683
#define IOCCN6                        684
#define IOCCN7                        685
#define IOCCF                         686
#define IOCCF0                        687
#define IOCCF1                        688
#define IOCCF2                        689
#define IOCCF3                        690
#define IOCCF4                        691
#define IOCCF5                        692
#define IOCCF6                        693
#define IOCCF7                        694
#define TMR4                          695
#define PR4                           696
#define T4CON                         697
#define T4CKPS0                       698
#define T4CKPS                        699
#define T4CKPS1                       700
#define TMR4ON                        701
#define T4OUTPS                       702
#define T4OUTPS0                      703
#define T4OUTPS1                      704
#define T4OUTPS2                      705
#define T4OUTPS3                      706
#define TMR6                          707
#define PR6                           708
#define T6CON                         709
#define T6CKPS0                       710
#define T6CKPS                        711
#define T6CKPS1                       712
#define TMR6ON                        713
#define T6OUTPS0                      714
#define T6OUTPS                       715
#define T6OUTPS1                      716
#define T6OUTPS2                      717
#define T6OUTPS3                      718
#define OPA1CON                       719
#define OPA1PCH                       720
#define OPA1PCH0                      721
#define OPA1PCH1                      722
#define OPA1UG                        723
#define OPA1SP                        724
#define OPA1EN                        725
#define OPA2CON                       726
#define OPA2PCH                       727
#define OPA2PCH0                      728
#define OPA2PCH1                      729
#define OPA2UG                        730
#define OPA2SP                        731
#define OPA2EN                        732
#define PWM3DCL0                      733
#define PWM3DCL                       734
#define PWM3DCL1                      735
#define PWM3DCH0                      736
#define PWM3DCH                       737
#define PWM3DCH1                      738
#define PWM3DCH2                      739
#define PWM3DCH3                      740
#define PWM3DCH4                      741
#define PWM3DCH5                      742
#define PWM3DCH6                      743
#define PWM3DCH7                      744
#define PWM3CON                       745
#define PWM3POL                       746
#define PWM3OUT                       747
#define PWM3EN                        748
#define PWM4DCL                       749
#define PWM4DCL0                      750
#define PWM4DCL1                      751
#define PWM4DCH0                      752
#define PWM4DCH                       753
#define PWM4DCH1                      754
#define PWM4DCH2                      755
#define PWM4DCH3                      756
#define PWM4DCH4                      757
#define PWM4DCH5                      758
#define PWM4DCH6                      759
#define PWM4DCH7                      760
#define PWM4CON                       761
#define PWM4POL                       762
#define PWM4OUT                       763
#define PWM4EN                        764
#define COG1PHR                       765
#define G1PHR                         766
#define G1PHR0                        767
#define G1PHR1                        768
#define G1PHR2                        769
#define G1PHR3                        770
#define G1PHR4                        771
#define G1PHR5                        772
#define COG1PHF                       773
#define G1PHF0                        774
#define G1PHF                         775
#define G1PHF1                        776
#define G1PHF2                        777
#define G1PHF3                        778
#define G1PHF4                        779
#define G1PHF5                        780
#define COG1BLKR                      781
#define G1BLKR                        782
#define G1BLKR0                       783
#define G1BLKR1                       784
#define G1BLKR2                       785
#define G1BLKR3                       786
#define G1BLKR4                       787
#define G1BLKR5                       788
#define COG1BLKF                      789
#define G1BLKF                        790
#define G1BLKF0                       791
#define G1BLKF1                       792
#define G1BLKF2                       793
#define G1BLKF3                       794
#define G1BLKF4                       795
#define G1BLKF5                       796
#define COG1DBR                       797
#define G1DBR0                        798
#define G1DBR                         799
#define G1DBR1                        800
#define G1DBR2                        801
#define G1DBR3                        802
#define G1DBR4                        803
#define G1DBR5                        804
#define COG1DBF                       805
#define G1DBF0                        806
#define G1DBF                         807
#define G1DBF1                        808
#define G1DBF2                        809
#define G1DBF3                        810
#define G1DBF4                        811
#define G1DBF5                        812
#define COG1CON0                      813
#define G1MD0                         814
#define G1MD                          815
#define G1MD1                         816
#define G1MD2                         817
#define G1CS0                         818
#define G1CS                          819
#define G1CS1                         820
#define G1LD                          821
#define G1EN                          822
#define COG1CON1                      823
#define G1POLA                        824
#define G1POLB                        825
#define G1POLC                        826
#define G1POLD                        827
#define G1FDBS                        828
#define G1RDBS                        829
#define COG1RIS                       830
#define G1RIS0                        831
#define G1RIS1                        832
#define G1RIS2                        833
#define G1RIS3                        834
#define G1RIS4                        835
#define G1RIS5                        836
#define G1RIS6                        837
#define COG1RSIM                      838
#define G1RSIM0                       839
#define G1RSIM1                       840
#define G1RSIM2                       841
#define G1RSIM3                       842
#define G1RSIM4                       843
#define G1RSIM5                       844
#define G1RSIM6                       845
#define COG1FIS                       846
#define G1FIS0                        847
#define G1FIS1                        848
#define G1FIS2                        849
#define G1FIS3                        850
#define G1FIS4                        851
#define G1FIS5                        852
#define G1FIS6                        853
#define COG1FSIM                      854
#define G1FSIM0                       855
#define G1FSIM1                       856
#define G1FSIM2                       857
#define G1FSIM3                       858
#define G1FSIM4                       859
#define G1FSIM5                       860
#define G1FSIM6                       861
#define COG1ASD0                      862
#define G1ASDAC0                      863
#define G1ASDAC                       864
#define G1ASDAC1                      865
#define G1ASDBD0                      866
#define G1ASDBD                       867
#define G1ASDBD1                      868
#define G1ARSEN                       869
#define G1ASE                         870
#define COG1ASD1                      871
#define G1AS0E                        872
#define G1AS1E                        873
#define G1AS2E                        874
#define G1AS3E                        875
#define COG1STR                       876
#define G1STRA                        877
#define G1STRB                        878
#define G1STRC                        879
#define G1STRD                        880
#define G1SDATA                       881
#define G1SDATB                       882
#define G1SDATC                       883
#define G1SDATD                       884
#define PPSLOCK                       885
#define PPSLOCKED                     886
#define INTPPS                        887
#define T0CKIPPS                      888
#define T1CKIPPS                      889
#define T1GPPS                        890
#define CCP1PPS                       891
#define CCP2PPS                       892
#define COGINPPS                      893
#define SSPCLKPPS                     894
#define SSPDATPPS                     895
#define SSPSSPPS                      896
#define RXPPS                         897
#define CKPPS                         898
#define CLCIN0PPS                     899
#define CLCIN1PPS                     900
#define CLCIN2PPS                     901
#define CLCIN3PPS                     902
#define RA0PPS                        903
#define RA1PPS                        904
#define RA2PPS                        905
#define RA4PPS                        906
#define RA5PPS                        907
#define RB4PPS                        908
#define RB5PPS                        909
#define RB6PPS                        910
#define RB7PPS                        911
#define RC0PPS                        912
#define RC1PPS                        913
#define RC2PPS                        914
#define RC3PPS                        915
#define RC4PPS                        916
#define RC5PPS                        917
#define RC6PPS                        918
#define RC7PPS                        919
#define CLCDATA                       920
#define MCLC1OUT                      921
#define MCLC2OUT                      922
#define MCLC3OUT                      923
#define CLC1CON                       924
#define CLC1CON_MODE                  925
#define LC1MODE0                      926
#define LC1MODE                       927
#define CLC1CON_MODE0                 928
#define LC1MODE1                      929
#define CLC1CON_MODE1                 930
#define CLC1CON_MODE2                 931
#define LC1MODE2                      932
#define LC1INTN                       933
#define CLC1CON_INTN                  934
#define LC1INTP                       935
#define CLC1CON_INTP                  936
#define CLC1CON_OUT                   937
#define LC1OUT                        938
#define LC1EN                         939
#define CLC1CON_EN                    940
#define CLC1POL                       941
#define LC1G1POL                      942
#define CLC1POL_G1POL                 943
#define CLC1POL_G2POL                 944
#define LC1G2POL                      945
#define LC1G3POL                      946
#define CLC1POL_G3POL                 947
#define LC1G4POL                      948
#define CLC1POL_G4POL                 949
#define CLC1POL_POL                   950
#define LC1POL                        951
#define CLC1SEL0                      952
#define CLC1SEL0_D1S0                 953
#define LC1D1S                        954
#define LC1D1S0                       955
#define CLC1SEL0_D1S                  956
#define CLC1SEL0_D1S1                 957
#define LC1D1S1                       958
#define CLC1SEL0_D1S2                 959
#define LC1D1S2                       960
#define CLC1SEL0_D1S3                 961
#define LC1D1S3                       962
#define CLC1SEL0_D1S4                 963
#define LC1D1S4                       964
#define CLC1SEL1                      965
#define CLC1SEL1_D2S0                 966
#define CLC1SEL1_D2S                  967
#define LC1D2S                        968
#define LC1D2S0                       969
#define CLC1SEL1_D2S1                 970
#define LC1D2S1                       971
#define LC1D2S2                       972
#define CLC1SEL1_D2S2                 973
#define LC1D2S3                       974
#define CLC1SEL1_D2S3                 975
#define LC1D2S4                       976
#define CLC1SEL1_D2S4                 977
#define CLC1SEL2                      978
#define LC1D3S0                       979
#define CLC1SEL2_D3S                  980
#define LC1D3S                        981
#define CLC1SEL2_D3S0                 982
#define LC1D3S1                       983
#define CLC1SEL2_D3S1                 984
#define LC1D3S2                       985
#define CLC1SEL2_D3S2                 986
#define LC1D3S3                       987
#define CLC1SEL2_D3S3                 988
#define LC1D3S4                       989
#define CLC1SEL2_D3S4                 990
#define CLC1SEL3                      991
#define CLC1SEL3_D4S                  992
#define LC1D4S                        993
#define LC1D4S0                       994
#define CLC1SEL3_D4S0                 995
#define CLC1SEL3_D4S1                 996
#define LC1D4S1                       997
#define LC1D4S2                       998
#define CLC1SEL3_D4S2                 999
#define LC1D4S3                       1000
#define CLC1SEL3_D4S3                 1001
#define LC1D4S4                       1002
#define CLC1SEL3_D4S4                 1003
#define CLC1GLS0                      1004
#define CLC1GLS0_D1N                  1005
#define LC1G1D1N                      1006
#define CLC1GLS0_D1T                  1007
#define LC1G1D1T                      1008
#define LC1G1D2N                      1009
#define CLC1GLS0_D2N                  1010
#define LC1G1D2T                      1011
#define CLC1GLS0_D2T                  1012
#define CLC1GLS0_D3N                  1013
#define LC1G1D3N                      1014
#define CLC1GLS0_D3T                  1015
#define LC1G1D3T                      1016
#define CLC1GLS0_D4N                  1017
#define LC1G1D4N                      1018
#define CLC1GLS0_D4T                  1019
#define LC1G1D4T                      1020
#define CLC1GLS1                      1021
#define CLC1GLS1_D1N                  1022
#define LC1G2D1N                      1023
#define LC1G2D1T                      1024
#define CLC1GLS1_D1T                  1025
#define CLC1GLS1_D2N                  1026
#define LC1G2D2N                      1027
#define LC1G2D2T                      1028
#define CLC1GLS1_D2T                  1029
#define CLC1GLS1_D3N                  1030
#define LC1G2D3N                      1031
#define LC1G2D3T                      1032
#define CLC1GLS1_D3T                  1033
#define CLC1GLS1_D4N                  1034
#define LC1G2D4N                      1035
#define LC1G2D4T                      1036
#define CLC1GLS1_D4T                  1037
#define CLC1GLS2                      1038
#define CLC1GLS2_D1N                  1039
#define LC1G3D1N                      1040
#define LC1G3D1T                      1041
#define CLC1GLS2_D1T                  1042
#define LC1G3D2N                      1043
#define CLC1GLS2_D2N                  1044
#define LC1G3D2T                      1045
#define CLC1GLS2_D2T                  1046
#define CLC1GLS2_D3N                  1047
#define LC1G3D3N                      1048
#define LC1G3D3T                      1049
#define CLC1GLS2_D3T                  1050
#define LC1G3D4N                      1051
#define CLC1GLS2_D4N                  1052
#define LC1G3D4T                      1053
#define CLC1GLS2_D4T                  1054
#define CLC1GLS3                      1055
#define LC1G4D1N                      1056
#define CLC1GLS3_G4D1N                1057
#define LC1G4D1T                      1058
#define CLC1GLS3_G4D1T                1059
#define CLC1GLS3_G4D2N                1060
#define LC1G4D2N                      1061
#define CLC1GLS3_G4D2T                1062
#define LC1G4D2T                      1063
#define LC1G4D3N                      1064
#define CLC1GLS3_G4D3N                1065
#define LC1G4D3T                      1066
#define CLC1GLS3_G4D3T                1067
#define CLC1GLS3_G4D4N                1068
#define LC1G4D4N                      1069
#define CLC1GLS3_G4D4T                1070
#define LC1G4D4T                      1071
#define CLC2CON                       1072
#define LC2MODE0                      1073
#define CLC2CON_MODE                  1074
#define LC2MODE                       1075
#define CLC2CON_MODE0                 1076
#define LC2MODE1                      1077
#define CLC2CON_MODE1                 1078
#define LC2MODE2                      1079
#define CLC2CON_MODE2                 1080
#define LC2INTN                       1081
#define CLC2CON_INTN                  1082
#define LC2INTP                       1083
#define CLC2CON_INTP                  1084
#define CLC2CON_OUT                   1085
#define LC2OUT                        1086
#define CLC2CON_EN                    1087
#define LC2EN                         1088
#define CLC2POL                       1089
#define LC2G1POL                      1090
