tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1708_tdd.h
#define CLC2POL_G1POL                 1091
#define LC2G2POL                      1092
#define CLC2POL_G2POL                 1093
#define LC2G3POL                      1094
#define CLC2POL_G3POL                 1095
#define LC2G4POL                      1096
#define CLC2POL_G4POL                 1097
#define CLC2POL_POL                   1098
#define LC2POL                        1099
#define CLC2SEL0                      1100
#define CLC2SEL0_D1S                  1101
#define LC2D1S0                       1102
#define CLC2SEL0_D1S0                 1103
#define LC2D1S                        1104
#define LC2D1S1                       1105
#define CLC2SEL0_D1S1                 1106
#define LC2D1S2                       1107
#define CLC2SEL0_D1S2                 1108
#define CLC2SEL0_D1S3                 1109
#define LC2D1S3                       1110
#define LC2D1S4                       1111
#define CLC2SEL0_D1S4                 1112
#define CLC2SEL1                      1113
#define LC2D2S0                       1114
#define CLC2SEL1_D2S0                 1115
#define LC2D2S                        1116
#define CLC2SEL1_D2S                  1117
#define LC2D2S1                       1118
#define CLC2SEL1_D2S1                 1119
#define LC2D2S2                       1120
#define CLC2SEL1_D2S2                 1121
#define LC2D2S3                       1122
#define CLC2SEL1_D2S3                 1123
#define LC2D2S4                       1124
#define CLC2SEL1_D2S4                 1125
#define CLC2SEL2                      1126
#define CLC2SEL2_D3S                  1127
#define LC2D3S0                       1128
#define CLC2SEL2_D3S0                 1129
#define LC2D3S                        1130
#define CLC2SEL2_D3S1                 1131
#define LC2D3S1                       1132
#define LC2D3S2                       1133
#define CLC2SEL2_D3S2                 1134
#define LC2D3S3                       1135
#define CLC2SEL2_D3S3                 1136
#define LC2D3S4                       1137
#define CLC2SEL2_D3S4                 1138
#define CLC2SEL3                      1139
#define LC2D4S                        1140
#define LC2D4S0                       1141
#define CLC2SEL3_D4S                  1142
#define CLC2SEL3_D4S0                 1143
#define LC2D4S1                       1144
#define CLC2SEL3_D4S1                 1145
#define LC2D4S2                       1146
#define CLC2SEL3_D4S2                 1147
#define CLC2SEL3_D4S3                 1148
#define LC2D4S3                       1149
#define LC2D4S4                       1150
#define CLC2SEL3_D4S4                 1151
#define CLC2GLS0                      1152
#define LC2G1D1N                      1153
#define CLC2GLS0_D1N                  1154
#define CLC2GLS0_D1T                  1155
#define LC2G1D1T                      1156
#define LC2G1D2N                      1157
#define CLC2GLS0_D2N                  1158
#define CLC2GLS0_D2T                  1159
#define LC2G1D2T                      1160
#define LC2G1D3N                      1161
#define CLC2GLS0_D3N                  1162
#define CLC2GLS0_D3T                  1163
#define LC2G1D3T                      1164
#define LC2G1D4N                      1165
#define CLC2GLS0_D4N                  1166
#define CLC2GLS0_D4T                  1167
#define LC2G1D4T                      1168
#define CLC2GLS1                      1169
#define CLC2GLS1_D1N                  1170
#define LC2G2D1N                      1171
#define CLC2GLS1_D1T                  1172
#define LC2G2D1T                      1173
#define CLC2GLS1_D2N                  1174
#define LC2G2D2N                      1175
#define CLC2GLS1_D2T                  1176
#define LC2G2D2T                      1177
#define LC2G2D3N                      1178
#define CLC2GLS1_D3N                  1179
#define LC2G2D3T                      1180
#define CLC2GLS1_D3T                  1181
#define LC2G2D4N                      1182
#define CLC2GLS1_D4N                  1183
#define LC2G2D4T                      1184
#define CLC2GLS1_D4T                  1185
#define CLC2GLS2                      1186
#define LC2G3D1N                      1187
#define CLC2GLS2_D1N                  1188
#define CLC2GLS2_D1T                  1189
#define LC2G3D1T                      1190
#define CLC2GLS2_D2N                  1191
#define LC2G3D2N                      1192
#define LC2G3D2T                      1193
#define CLC2GLS2_D2T                  1194
#define CLC2GLS2_D3N                  1195
#define LC2G3D3N                      1196
#define CLC2GLS2_D3T                  1197
#define LC2G3D3T                      1198
#define CLC2GLS2_D4N                  1199
#define LC2G3D4N                      1200
#define LC2G3D4T                      1201
#define CLC2GLS2_D4T                  1202
#define CLC2GLS3                      1203
#define LC2G4D1N                      1204
#define CLC2GLS3_G4D1N                1205
#define CLC2GLS3_G4D1T                1206
#define LC2G4D1T                      1207
#define CLC2GLS3_G4D2N                1208
#define LC2G4D2N                      1209
#define LC2G4D2T                      1210
#define CLC2GLS3_G4D2T                1211
#define CLC2GLS3_G4D3N                1212
#define LC2G4D3N                      1213
#define CLC2GLS3_G4D3T                1214
#define LC2G4D3T                      1215
#define LC2G4D4N                      1216
#define CLC2GLS3_G4D4N                1217
#define CLC2GLS3_G4D4T                1218
#define LC2G4D4T                      1219
#define CLC3CON                       1220
#define LC3MODE0                      1221
#define CLC3CON_MODE0                 1222
#define CLC3CON_MODE                  1223
#define LC3MODE                       1224
#define LC3MODE1                      1225
#define CLC3CON_MODE1                 1226
#define LC3MODE2                      1227
#define CLC3CON_MODE2                 1228
#define LC3INTN                       1229
#define CLC3CON_INTN                  1230
#define CLC3CON_INTP                  1231
#define LC3INTP                       1232
#define CLC3CON_OUT                   1233
#define LC3OUT                        1234
#define LC3EN                         1235
#define CLC3CON_EN                    1236
#define CLC3POL                       1237
#define LC3G1POL                      1238
#define CLC3POL_G1POL                 1239
#define LC3G2POL                      1240
#define CLC3POL_G2POL                 1241
#define CLC3POL_G3POL                 1242
#define LC3G3POL                      1243
#define LC3G4POL                      1244
#define CLC3POL_G4POL                 1245
#define LC3POL                        1246
#define CLC3POL_POL                   1247
#define CLC3SEL0                      1248
#define CLC3SEL0_D1S0                 1249
#define LC3D1S0                       1250
#define LC3D1S                        1251
#define CLC3SEL0_D1S                  1252
#define LC3D1S1                       1253
#define CLC3SEL0_D1S1                 1254
#define LC3D1S2                       1255
#define CLC3SEL0_D1S2                 1256
#define LC3D1S3                       1257
#define CLC3SEL0_D1S3                 1258
#define LC3D1S4                       1259
#define CLC3SEL0_D1S4                 1260
#define CLC3SEL1                      1261
#define CLC3SEL1_D2S                  1262
#define CLC3SEL1_D2S0                 1263
#define LC3D2S                        1264
#define LC3D2S0                       1265
#define CLC3SEL1_D2S1                 1266
#define LC3D2S1                       1267
#define CLC3SEL1_D2S2                 1268
#define LC3D2S2                       1269
#define CLC3SEL1_D2S3                 1270
#define LC3D2S3                       1271
#define LC3D2S4                       1272
#define CLC3SEL1_D2S4                 1273
#define CLC3SEL2                      1274
#define CLC3SEL2_D3S0                 1275
#define LC3D3S                        1276
#define CLC3SEL2_D3S                  1277
#define LC3D3S0                       1278
#define LC3D3S1                       1279
#define CLC3SEL2_D3S1                 1280
#define LC3D3S2                       1281
#define CLC3SEL2_D3S2                 1282
#define LC3D3S3                       1283
#define CLC3SEL2_D3S3                 1284
#define LC3D3S4                       1285
#define CLC3SEL2_D3S4                 1286
#define CLC3SEL3                      1287
#define CLC3SEL3_D4S0                 1288
#define LC3D4S0                       1289
#define LC3D4S                        1290
#define CLC3SEL3_D4S                  1291
#define LC3D4S1                       1292
#define CLC3SEL3_D4S1                 1293
#define LC3D4S2                       1294
#define CLC3SEL3_D4S2                 1295
#define LC3D4S3                       1296
#define CLC3SEL3_D4S3                 1297
#define LC3D4S4                       1298
#define CLC3SEL3_D4S4                 1299
#define CLC3GLS0                      1300
#define CLC3GLS0_D1N                  1301
#define LC3G1D1N                      1302
#define LC3G1D1T                      1303
#define CLC3GLS0_D1T                  1304
#define LC3G1D2N                      1305
#define CLC3GLS0_D2N                  1306
#define CLC3GLS0_D2T                  1307
#define LC3G1D2T                      1308
#define CLC3GLS0_D3N                  1309
#define LC3G1D3N                      1310
#define LC3G1D3T                      1311
#define CLC3GLS0_D3T                  1312
#define CLC3GLS0_D4N                  1313
#define LC3G1D4N                      1314
#define CLC3GLS0_D4T                  1315
#define LC3G1D4T                      1316
#define CLC3GLS1                      1317
#define LC3G2D1N                      1318
#define CLC3GLS1_D1N                  1319
#define CLC3GLS1_D1T                  1320
#define LC3G2D1T                      1321
#define LC3G2D2N                      1322
#define CLC3GLS1_D2N                  1323
#define LC3G2D2T                      1324
#define CLC3GLS1_D2T                  1325
#define LC3G2D3N                      1326
#define CLC3GLS1_D3N                  1327
#define CLC3GLS1_D3T                  1328
#define LC3G2D3T                      1329
#define LC3G2D4N                      1330
#define CLC3GLS1_D4N                  1331
#define LC3G2D4T                      1332
#define CLC3GLS1_D4T                  1333
#define CLC3GLS2                      1334
#define LC3G3D1N                      1335
#define CLC3GLS2_D1N                  1336
#define LC3G3D1T                      1337
#define CLC3GLS2_D1T                  1338
#define CLC3GLS2_D2N                  1339
#define LC3G3D2N                      1340
#define CLC3GLS2_D2T                  1341
#define LC3G3D2T                      1342
#define CLC3GLS2_D3N                  1343
#define LC3G3D3N                      1344
#define LC3G3D3T                      1345
#define CLC3GLS2_D3T                  1346
#define CLC3GLS2_D4N                  1347
#define LC3G3D4N                      1348
#define CLC3GLS2_D4T                  1349
#define LC3G3D4T                      1350
#define CLC3GLS3                      1351
#define LC3G4D1N                      1352
#define CLC3GLS3_G4D1N                1353
#define LC3G4D1T                      1354
#define CLC3GLS3_G4D1T                1355
#define LC3G4D2N                      1356
#define CLC3GLS3_G4D2N                1357
#define CLC3GLS3_G4D2T                1358
#define LC3G4D2T                      1359
#define LC3G4D3N                      1360
#define CLC3GLS3_G4D3N                1361
#define CLC3GLS3_G4D3T                1362
#define LC3G4D3T                      1363
#define LC3G4D4N                      1364
#define CLC3GLS3_G4D4N                1365
#define LC3G4D4T                      1366
#define CLC3GLS3_G4D4T                1367
#define STATUS_SHAD                   1368
#define C_SHAD                        1369
#define DC_SHAD                       1370
#define Z_SHAD                        1371
#define WREG_SHAD                     1372
#define BSR_SHAD                      1373
#define PCLATH_SHAD                   1374
#define FSR0L_SHAD                    1375
#define FSR0H_SHAD                    1376
#define FSR1L_SHAD                    1377
#define FSR1H_SHAD                    1378
#define STKPTR                        1379
#define TOSL                          1380
#define TOSH                          1381

#endif // _PIC16F1708_H_
